programming/hadoop/hdfs-permission-guide-note.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-08-26 六 09:10 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Note on "HDFS Permission Guide"</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Zhao WenBin">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Note on "HDFS Permission Guide"</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge40999b">Overview</a></li>
<li><a href="#orgd20f542"><span class="todo TODO">TODO</span> User Identity</a></li>
<li><a href="#org6e215a0">Group Mapping</a></li>
<li><a href="#org31e8b8f">Understanding the Implementation</a></li>
<li><a href="#org07d3c2f"><span class="todo TODO">TODO</span> SuperUser</a></li>
<li><a href="#orge0c1b16"><span class="todo TODO">TODO</span> ACLs</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orge40999b" class="outline-2">
<h2 id="orge40999b">Overview</h2>
<div class="outline-text-2" id="text-orge40999b">
</div><div id="outline-container-org8f26cbc" class="outline-3">
<h3 id="org8f26cbc">与 Posix 相同之处</h3>
<div class="outline-text-3" id="text-org8f26cbc">
<ul class="org-ul">
<li>hdfs 实现了类 UNIX 的文件和目录的权限，抽象出用户和组的概念</li>
<li>权限分为：用户、组和其它三类</li>
<li>文件有可读、可写权限</li>
<li>目录可读表示可以列出其内容</li>
<li>目录可写表示可以创建或删除其中数据</li>
<li>目录可执行(x) 表示允许访问目录中的子文件（或目录）</li>
</ul>
</div>
</div>

<div id="outline-container-org3fa5f5e" class="outline-3">
<h3 id="org3fa5f5e">与 Posix 不同之处</h3>
<div class="outline-text-3" id="text-org3fa5f5e">
<ul class="org-ul">
<li>没有 setuid 或 setgid 位</li>
<li>没有可执行文件的概念</li>
<li>目录可以设置 Sticky 位，只允许 superuser 和文件的属主来删除或移动其文件</li>
<li>创建文件或目录时，owner 是客户端用户，group 继承自父目录的 group</li>
<li>HDFS 提供额外的 ACL 机制，来更精细的控制文件权限</li>
</ul>
</div>
</div>


<div id="outline-container-org8230935" class="outline-3">
<h3 id="org8230935">认证过程</h3>
<div class="outline-text-3" id="text-org8230935">
<ol class="org-ol">
<li>user name 认证</li>
<li>group lists 认证</li>
</ol>
</div>
</div>
</div>



<div id="outline-container-orgd20f542" class="outline-2">
<h2 id="orgd20f542"><span class="todo TODO">TODO</span> User Identity</h2>
<div class="outline-text-2" id="text-orgd20f542">
</div><div id="outline-container-orgfefc124" class="outline-3">
<h3 id="orgfefc124">方式</h3>
<div class="outline-text-3" id="text-orgfefc124">
<p>
分为两种，由 <code>hadoop.security.authentication</code> 来控制
</p>

<dl class="org-dl">
<dt>simple</dt><dd>使用 <code>whoami</code> 命令确定主机的用户</dd>
<dt>kerberos</dt><dd>??</dd>
</dl>
</div>
</div>

<div id="outline-container-orgb5f4328" class="outline-3">
<h3 id="orgb5f4328">注意</h3>
<div class="outline-text-3" id="text-orgb5f4328">
<ul class="org-ul">
<li>不同的用户身份识别方式对 HDFS 没有影响</li>
<li>HDFS 没有创建用户、建立组或认证的机制</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6e215a0" class="outline-2">
<h2 id="org6e215a0">Group Mapping</h2>
<div class="outline-text-2" id="text-org6e215a0">
<ul class="org-ul">
<li>HDFS 确定用户后，通过 group mapping service 来确定对应的 group list</li>
<li>该服务通过 <code>hadoop.security.group.mapping</code> 配置来确定</li>
<li>TDH 中该配置为 <code>ShellBasedUnixGroupsMapping</code></li>
<li>ShellBasedUnixGroupsMapping 在 UNIX 环境中使用 <code>bash -c groups</code> (group命令)来获取组信息</li>
<li>除些之外，还有 <code>JniBasedUnixGroupsMappingWithFallback</code> 模式</li>
<li><code>LdapGroupsMapping</code> 联系 LDAP 服务来获取 list of groups</li>
<li><b>获取 group list 的动作在 NameNode 上进行</b></li>
</ul>
</div>
</div>

<div id="outline-container-org31e8b8f" class="outline-2">
<h2 id="org31e8b8f">Understanding the Implementation</h2>
<div class="outline-text-2" id="text-org31e8b8f">
<ul class="org-ul">
<li>权限管理针对的完整路径，在每次操作时会进行</li>
<li>HDFS 客户端连接 name node 时带着 user id 信息</li>
<li>权限是针对块级别的，同一个文件可能中途失败</li>
</ul>
</div>
</div>







<div id="outline-container-org07d3c2f" class="outline-2">
<h2 id="org07d3c2f"><span class="todo TODO">TODO</span> SuperUser</h2>
<div class="outline-text-2" id="text-org07d3c2f">
<ul class="org-ul">
<li>namenode 进程用户是超级用户（一般是 hdfs）</li>
<li>另外可以手动设定一系列组，组内成员作为超级用户（How？）</li>
</ul>
</div>
</div>

<div id="outline-container-orge0c1b16" class="outline-2">
<h2 id="orge0c1b16"><span class="todo TODO">TODO</span> ACLs</h2>
<div class="outline-text-2" id="text-orge0c1b16">
</div><div id="outline-container-orgc2b7251" class="outline-3">
<h3 id="orgc2b7251">概述</h3>
<div class="outline-text-3" id="text-orgc2b7251">
<ul class="org-ul">
<li>ACL 提供不同的用户和组方式的权限管理</li>
<li>默认 HDFS 关闭 ACL 支持，不允许创建 ACLs</li>
<li>通过设置 <code>dfs.namenode.acls.enabled</code> 来开启</li>
<li>ACL 是一系列的规则（类似 iptables）</li>
</ul>
</div>
</div>

<div id="outline-container-org6719dd8" class="outline-3">
<h3 id="org6719dd8">规则</h3>
<div class="outline-text-3" id="text-org6719dd8">
<ul class="org-ul">
<li>包含三部分，用 ':' 分隔，分别是 type, optional name, permission string</li>
<li>type 为 user, group, other 以及 mask</li>
<li>每个 ACL 规则组需要有一个 mask，否则用自动生成一个（根据当前的权限求并）</li>
<li>chmod 实际上修改了 mask 的信息</li>
<li>可以前缀 'default:' 来描写 default ACL</li>
</ul>
</div>
</div>


<div id="outline-container-org366dd54" class="outline-3">
<h3 id="org366dd54">示例</h3>
<div class="outline-text-3" id="text-org366dd54">
<pre class="example">
user::rw-
user:bruce:rwx  # bruce 用户 777 -&gt; r--
group::r-x      #                r--
group:sales:rwx # sales 组 777 -&gt; r--
mask::r--       # 影响全部 named user, named group, unamed group
other::r--      # 654 权限
</pre>
</div>
</div>

<div id="outline-container-orgbba2e30" class="outline-3">
<h3 id="orgbba2e30">default ACL vs access ACL</h3>
<div class="outline-text-3" id="text-orgbba2e30">
<ul class="org-ul">
<li>default ACL 用于新文件和目录的创建时缺省的权限</li>
<li>access ACL 定义了权限检查</li>
<li>前者类似 umask ? 并只针对目录</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhao WenBin</p>
<p class="date">Created: 2017-08-26 六 09:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
